// Задача 28: Напишите программу, которая
// принимает на вход число N и выдаёт
// произведение чисел от 1 до N.
// 4 -> 24
// 5 -> 120

Console.WriteLine("Введите натуральное число N");
int number = Convert.ToInt32(Console.ReadLine());


Console.WriteLine($"Произведение чисел от {number} - {MultiplyOfNumbers(number)}");

int MultiplyOfNumbers(int num)
{
    int result = 1;
    for (int i = 1; i <= num; i++)
    {
        checked
        {
            result = result * i;
        }
    }
    return result;
}
